UT_Marketplaces.Marketplaces/src/Documents/рар_мп_УстановкаЦенНоменклатуры/рар_мп_УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рар_мп_УстановкаЦенНоменклатуры</name>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаWB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаWBКлуба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены_МинимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены_Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены_ЦенаДоСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены_ЦенаТовараСУчётомСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDРазмера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьСменыЦенДляРазмеров</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баракод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SKUТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены_Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаWBКлуба</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/рар_мп_УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Module.bsl
//@skip-check module-structure-top-region
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
    Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПриПовторномОткрытии()
    Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал механизма не доступен'");
        Сообщение.Сообщить();
        //@skip-check module-self-reference
ЭтотОбъект.Закрыть();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал механизма не доступен'");
		Сообщение.Сообщить();
		//@skip-check module-self-reference
		ЭтотОбъект.Закрыть();
	Иначе
		Аккаунт = ОпределенияМаркетплейса();	
		
		Если Аккаунт <> Неопределено Тогда
			
			ИзменениеВидимостиЦен();
			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановитьСкидкуWBКлубаПриИзменении(Элемент)
	
	Если УстановитьСкидкуWBКлуба Тогда
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWBКлуба.Видимость 	= Истина;
		Элементы.СкидкаWBКлуба.Видимость												= Истина;
	Иначе
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWBКлуба.Видимость 	= Ложь;
		Элементы.СкидкаWBКлуба.Видимость												= Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбработкаКомандыВыбрать

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура Выбрать(Команда) 
	
	Если ЗначениеЗаполнено(Объект.Аккаунт) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аккаунт", Объект.Аккаунт);
		
		//@skip-check form-self-reference
		ОткрытьФорму("Обработка.рар_мп_ОбновлениеЦен_ПодборНоменклатуры.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма);
		
	Иначе                                                            
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен аккаунт маркетплейса");
		
	КонецЕсли;   
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьПодбор(АдресВХ) Экспорт
	
	ОбработатьПодборНаСервере(АдресВХ);
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьПодборНаСервере(АдресВХ)

	НоменклатураИзПодбора = ПолучитьИзВременногоХранилища(АдресВХ); 
	
	Если НоменклатураИзПодбора.Количество() > 0 Тогда
		
		Для каждого Элем из НоменклатураИзПодбора Цикл  
			
			СтруктураОтбора = Новый Структура; 
			СтруктураОтбора.Вставить("Номенклатура", 	Элем.Номенклатура);
			СтруктураОтбора.Вставить("Упаковка", 		Элем.Упаковка);
			СтруктураОтбора.Вставить("Характеристика", 	Элем.Характеристика);
			СтруктураОтбора.Вставить("Артикул", 		Элем.Артикул);
			СтруктураОтбора.Вставить("УникальныйНомер", Элем.IDТовара);
			СтруктураОтбора.Вставить("Баракод", 		Элем.Баракод);
			СтруктураОтбора.Вставить("SKUТовара", 		Элем.SKUТовара);
			
			Если Объект.Номенклатура.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				
				НоваяСтрока 				  				= Объект.Номенклатура.Добавить();
				НоваяСтрока.Номенклатура     				= Элем.Номенклатура; 
				НоваяСтрока.Характеристика   				= Элем.Характеристика;
				НоваяСтрока.Упаковка		  				= Элем.Упаковка;
				НоваяСтрока.Артикул          				= Элем.Артикул;
				НоваяСтрока.УникальныйНомер  				= Элем.IDТовара;
				НоваяСтрока.Баракод						= Элем.Баракод;
				НоваяСтрока.SKUТовара						= Элем.SKUТовара;
				НоваяСтрока.Размер			  				= Элем.Размер;
				НоваяСтрока.IDРазмера		  				= Элем.IDРазмера;
				НоваяСтрока.ВозможностьСменыЦенДляРазмеров = Элем.ВозможностьСменыЦенДляРазмеров;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры       

#КонецОбласти   

//@skip-check module-structure-top-region
#Область АккаунтПриИзменении

&НаСервере
Процедура АккаунтПриИзмененииНаСервере()
	
	Объект.Номенклатура.Очистить(); 
	
КонецПроцедуры 

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура АккаунтПриИзменении(Элемент)
	
	АккаунтПриИзмененииНаСервере();
	
	ИзменениеВидимостиЦен();
	
КонецПроцедуры 

#КонецОбласти

//@skip-check module-structure-top-region
#Область ЗагрузкаЦенВФорму  

&НаСервере
Функция ЗагрузитьЦеныНаСервере()
	
	Если НЕ Объект.Номенклатура.Количество() = 0 Тогда
		
		Если Не Объект.Аккаунт.Пустая() Тогда 
			
			Аккаунт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс");
			
			Если Аккаунт = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				ЦеныАккаунта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Аккаунт, 
																			"ВидЦены_МинимальнаяЦена, ВидЦены_Себестоимость, ВидЦены_ЦенаДоСкидок, ВидЦены_ЦенаТовараСУчётомСкидок"); 
				
				Возврат ЦеныАккаунта;  
				
			ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
				
				ЦеныАккаунта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Аккаунт, 
																			"ВидЦены_ЦенаДоСкидок, ВидЦены_ЦенаТовараСУчётомСкидок");
				
				Возврат ЦеныАккаунта;
				
			ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				ЦеныАккаунта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Аккаунт, 
																			"ВидЦены_Цена");
				
				Возврат ЦеныАккаунта;
				
			КонецЕсли;                                                   
			
		Иначе                               
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен аккаунт маркетплейса"); 
			
		КонецЕсли; 
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните товары, для которых необходимо передать цены");  
		
	КонецЕсли;  
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗагрузитьЦены(Команда) 
	
	ЦеныАккаунта = ЗагрузитьЦеныНаСервере(); 
	
	Если ЦеныАккаунта <> Неопределено Тогда
		
		ДлительнаяОперация = ЗапросПоВидамЦен(ЦеныАккаунта);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		Оповещение = Новый ОписаниеОповещения("ПриЗавершенииЗапроса", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли;  
	
КонецПроцедуры  
 
&НаСервере
Функция ЗапросПоВидамЦен(ЦеныАккаунта)       
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс"); 
	
	Валюта  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Валюта");
	
	МассивНоменклатуры = Объект.Номенклатура.Выгрузить();
	
	//@skip-check form-self-reference
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);
	
	СкидкиWB = Новый Структура("СкидкаWB, СкидкаWBКлуба", Объект.СкидкаWB, Объект.СкидкаWBКлуба);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбновлениеЦен.ПолучитьЦеныНоменклатурыПоАккаунту_Общее", 
													Объект.Аккаунт, Маркетплейс, ЦеныАккаунта, МассивНоменклатуры, Объект.Дата, Валюта, СкидкиWB);
	
КонецФункции  

&НаКлиенте
Процедура ПриЗавершенииЗапроса(РезультатИзВремХран, ДопПараметры) Экспорт
	
	Если РезультатИзВремХран = Неопределено Тогда  // пользователь отменил задание
		Возврат;
	КонецЕсли;
	
	Если РезультатИзВремХран.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатИзВремХран.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	ЗаполнениеТаблицСверки(РезультатИзВремХран);
	
	//ПоказатьПредупреждение( , "Таблицы обновлены!");      
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнениеТаблицСверки(РезультатИзВремХран)
	
	Результат = ПолучитьИзВременногоХранилища(РезультатИзВремХран.АдресРезультата); 
	
	Если Результат =  0 Тогда  
		
		ОбщегоНазначения.СообщитьПользователю("Запрос на формирования цен не выполнен, ошибка в установке цен номенклатуры или в настройка аккаунта");
		
	Иначе 
		
		Объект.Номенклатура.Загрузить(Результат);
		
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбновитьЦены

&НаСервере
Функция ОбновитьЦеныНаСервере()  
	
	Аккаунт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс");
	Валюта  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Валюта");
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Аккаунт", Аккаунт); 
	СтруктураДанных.Вставить("Валюта",  Валюта);
	
	Если Объект.Номенклатура.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните товары, для которых необходимо передать цены"); 
		ТаблицаЗаполнена = Ложь;
		
	Иначе
		
		Если Аккаунт = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			
			Если campaignId.Количество() > 0 Тогда
				
				ТаблицаЗаполнена = Истина;  
				
			Иначе  
				
				ТаблицаЗаполнена = Ложь;   
				
				ОбщегоНазначения.СообщитьПользователю("Заполните магазин, для которого производится обновления цен");
				
			КонецЕсли;
		Иначе
			
			ТаблицаЗаполнена = Истина;  
			
		КонецЕсли;    
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ТаблицаЗаполнена", ТаблицаЗаполнена);  
	
	Возврат СтруктураДанных;   
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	Данные = ОбновитьЦеныНаСервере(); 
	
	Если Данные.ТаблицаЗаполнена Тогда
		
		ДлительнаяОперация = ИзменитьЦеныНаМаркетПлейсе(Данные);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	    Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбновленияЦен", ЭтотОбъект);
	    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check bsl-legacy-check-method-for-statements-after-return
&НаСервере
Функция ИзменитьЦеныНаМаркетПлейсе(Данные)
	
	Если Данные.Аккаунт = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		//@skip-check form-self-reference
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);              
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбновлениеЦен.ОбновитьЦеныПоАккаунту_OZON", 
														Объект.Номенклатура.Выгрузить(), Объект.Аккаунт);  
		
	ИначеЕсли Данные.Аккаунт = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		//@skip-check form-self-reference
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);   
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбновлениеЦен.ОбновитьЦеныПоАккаунту_ЯндексМаркет", 
														Объект.Номенклатура.Выгрузить(), Объект.Аккаунт, campaignId.ВыгрузитьЗначения());  
														
	ИначеЕсли Данные.Аккаунт = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
														
		//@skip-check form-self-reference
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);   
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбновлениеЦен.ОбновитьЦеныПоАккаунту_Wildberries", 
														Объект.Номенклатура.Выгрузить(), Объект.Аккаунт, УстановитьСкидкуWBКлуба); 												
														
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияЦен(РезультатИзВремХран, ДопПараметры) Экспорт
	
	Если РезультатИзВремХран = Неопределено Тогда  // пользователь отменил задание
		Возврат;
	КонецЕсли;
	
	Если РезультатИзВремХран.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатИзВремХран.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	ПроверкаОбновленияЦен(РезультатИзВремХран); 
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаОбновленияЦен(РезультатИзВремХран)
 
	Результат = ПолучитьИзВременногоХранилища(РезультатИзВремХран.АдресРезультата); 
	
	Если Результат.КодСостояния = 200 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цены обновлены";
		Сообщение.Сообщить();
		
	Иначе  
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Произошла ошибка передачи цен номенклатуры. Подробности в журнале регистрации" ;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбработкаСпискаЗначенийСampaignId  

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура campaignIdНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АккаунтМаркетплейса", Объект.Аккаунт);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("ОбщаяФорма.рар_мп_ФормаВыбораСопоставленныхСкладов", ПараметрыФормы, Элементы.campaignId);
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура campaignIdОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	campaignId.Очистить();
	
	Для Каждого Склад Из ВыбранноеЗначение Цикл
		
		campaignId.Добавить(Склад.campaignId, Склад.Наименование + "(" + Склад.campaignId + ")");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбщиеПроцедурыФункции    

&НаКлиенте
Процедура ИзменениеВидимостиЦен()
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда 
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость         				= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураУникальныйНомер.Видимость         		= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость         					= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_МинимальнаяЦена.Видимость         = Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Себестоимость.Видимость           = Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаДоСкидок.Видимость 		    = Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаТовараСУчётомСкидок.Видимость = Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Цена.Видимость         			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWB.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWBКлуба.Видимость         			= Ложь;
		
		Элементы.campaignId.Видимость 				= Ложь; 
		Элементы.УстановитьСкидкуWBКлуба.Видимость 	= Ложь;
		Элементы.СкидкаWB.Видимость					= Ложь;
		Элементы.СкидкаWBКлуба.Видимость			= Ложь;
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость         				= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураУникальныйНомер.Видимость         		= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость         					= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость         				= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_МинимальнаяЦена.Видимость         = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Себестоимость.Видимость           = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаДоСкидок.Видимость 		    = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаТовараСУчётомСкидок.Видимость = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Цена.Видимость         			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWB.Видимость         				= Истина;
		
		Элементы.campaignId.Видимость 				= Ложь;
		Элементы.УстановитьСкидкуWBКлуба.Видимость 	= Истина;
		Элементы.СкидкаWB.Видимость					= Истина;
		Элементы.СкидкаWBКлуба.Видимость			= Ложь;
		
	ИначеЕсли ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость         				= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураУникальныйНомер.Видимость         		= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость         					= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_МинимальнаяЦена.Видимость         = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Себестоимость.Видимость           = Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаДоСкидок.Видимость 			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_ЦенаТовараСУчётомСкидок.Видимость = Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураВидЦены_Цена.Видимость         			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWB.Видимость         				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураСкидкаWBКлуба.Видимость         			= Ложь;
		
		Элементы.campaignId.Видимость 				= Истина;	       
		Элементы.УстановитьСкидкуWBКлуба.Видимость 	= Ложь;
		Элементы.СкидкаWB.Видимость					= Ложь;
		Элементы.СкидкаWBКлуба.Видимость			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ОпределенияМаркетплейса()
	
	Если Объект.Аккаунт.Пустая() Тогда
		
		Возврат Неопределено;  
		
	Иначе
		
		Если ОпределитьТекМаркетплейс_Ozon() Тогда  
			
			Возврат Истина;
			
		ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда 
			
			Возврат Истина;
			
		ИначеЕсли ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда  
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецФункции 

&НаСервере
Функция ОпределитьТекМаркетплейс_Ozon() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции  

 &НаСервере
Функция ОпределитьТекМаркетплейс_Wildberries() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции

 &НаСервере
Функция ОпределитьТекМаркетплейс_ЯндексМаркет() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
